In [4]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [5]:
titles = pd.read_csv('titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [75]:
cast = pd.read_csv('cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### What are the ten most common movie names of all time?

In [10]:
countMovie = titles['title'].value_counts()
countMovie
print('The 10 most common values of all time: ',countMovie[0:10])

The 10 most common values of all time:  Hamlet                  18
Carmen                  16
Macbeth                 15
Maya                    12
The Outsider            12
The Three Musketeers    11
Temptation              11
Kismet                  11
Freedom                 11
Othello                 11
Name: title, dtype: int64

### Which three years in the 1930s saw the most films released?

In [11]:
filter30 = titles['year'].between(1930, 1939)
films30 = titles[filter30]
films30

                          title  year
69         Das Blaue vom Himmel  1932
88                     Evensong  1934
100          The World Moves On  1934
109         World and the Flesh  1932
119              Grand Old Girl  1935
...                         ...   ...
232248          Sagebrush Trail  1933
232267              Yi jian mei  1931
232285        Cuor di vagabondo  1936
232287     Shadows of Sing Sing  1933
232310  Die Herrgottsgrenadiere  1932

[10097 rows x 2 columns]

In [21]:
countFilms30 = films30.groupby('year').count()
countFilms30

      title
year
1930    820
1931    886
1932    936
1933    894
1934    966
1935   1054
1936   1138
1937   1196
1938   1129
1939   1078

In [27]:
countFilms30.sort_values(by='title',ascending=False).iloc[0:3]

      title
year
1937   1196
1936   1138
1938   1129

In [ ]:
countFilms30.max

### Count the number of films that have been released in each decade over the history of cinema.

In [54]:
# Create new column for decade
titles['decade'] = titles['year']//10 *10
titles.groupby('decade').head()

                                                    title  year  decade
0                                          The Rising Son  1990    1990
1                                 The Thousand Plane Raid  1969    1960
2                                        Crucea de piatra  1993    1990
3                                                 Country  2000    2000
4                                              Gaiking II  2011    2010
...                                                   ...   ...     ...
20657   Pierrot's Problem, or How to Make a Fat Wife O...  1900    1900
28222                  The Joe Gans-Battling Nelson Fight  1906    1900
124505     Reproduction of the Corbett and Jeffries Fight  1899    1890
177757                                         Miss Jerry  1894    1890
215272                                 The Startled Lover  1898    1890

[68 rows x 3 columns]

In [61]:
# count number of movies per decade
titles.groupby('decade').agg({'title':'count'})

        title
decade
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210

In [42]:
"""The rest of the work for this question is no longer relevant as I found an easier way to create decade bins"""
# Get the years over which data exists
# latest = titles['year'].values.max()
# earliest = titles['year'].values.min()
# print(earliest, latest)

1894 2026

In [51]:
# create bins for each decade
decadesY1 = [y+10 for y in range(1890-10,2020,10)]
# decadesY1

[1890,
 1900,
 1910,
 1920,
 1930,
 1940,
 1950,
 1960,
 1970,
 1980,
 1990,
 2000,
 2010,
 2020]

In [52]:
decadeBins = []
for y1 in decadesY1:
    decadeBins.append((y1,y1+9))
print(decadeBins)

[(1890, 1899), (1900, 1909), (1910, 1919), (1920, 1929), (1930, 1939), (1940, 1949), (1950, 1959), (1960, 1969), (1970, 1979), (1980, 1989), (1990, 1999), (2000, 2009), (2010, 2019), (2020, 2029)]

### Count the number of "Hamlet" films made in each decade.

In [83]:
filter_ham = titles['title'].str.contains('Hamlet')
titles[filter_ham].groupby('decade',).agg({'title':'count'})

        title
decade
1910        4
1920        2
1930        1
1940        1
1950        1
1960        3
1970        4
1980        3
1990        6
2000       13
2010       16

In [72]:
# Just for fun, I wanted to list decade and all movie titles
titles[filter_ham].sort_values('decade').set_index('decade').sort_index(1,ascending=False)

C:\Users\silvh\AppData\Local\Temp\ipykernel_2548\2886769391.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.sort_index will be keyword-only.
  titles[filter_ham].sort_values('decade').set_index('decade').sort_index(1,ascending=False)

        year                                    title
decade
1910    1911                                   Hamlet
1910    1913                                   Hamlet
1910    1919                       A Sagebrush Hamlet
1910    1910                                   Hamlet
1920    1922                       Han, hun og Hamlet
1920    1921                                   Hamlet
1930    1932                       Han, hun og Hamlet
1940    1948                                   Hamlet
1950    1954                                   Hamlet
1960    1964                                   Hamlet
1960    1969                                   Hamlet
1960    1964                              Hamlet (II)
1970    1974      Predstava 'Hamleta' u Mrdusi Donjoj
1970    1976              Intikam Melegi/Kadin Hamlet
1970    1973                                   Hamlet
1970    1976                                   Hamlet
1980    1987                   Hamlet liikemaailmassa
1980    1989                Hamlet: Prince of Denmark
1980    1987                                   Hamlet
1990    1995                    Green Eggs and Hamlet
1990    1993                             H for Hamlet
1990    1996                              Fuck Hamlet
1990    1997                Hamlet, Prince of Denmark
1990    1990                                   Hamlet
1990    1996                                   Hamlet
2000    2007                              Hamlet (II)
2000    2005                              Hamlet (II)
2000    2003                                 Hamlet_X
2000    2009                                   Hamlet
2000    2005          Dogg's Hamlet, Cahoot's Macbeth
2000    2002                   Hamlet in the Hamptons
2000    2004                                 Hamlet X
2000    2008                                 Hamlet 2
2000    2000                                   Hamlet
2000    2009                           Kitchen Hamlet
2000    2007  The Tragedy of Hamlet Prince of Denmark
2000    2007                             Hamlet (III)
2000    2008                Hamlet the Vampire Slayer
2010    2015                           Hamlet's Ghost
2010    2014                                   Hamlet
2010    2016        Royal Shakespeare Company: Hamlet
2010    2015                 Hamlet, Son of a Kingpin
2010    2012                            Zombie Hamlet
2010    2015                              Hamlet (II)
2010    2014                            Hamlet A.D.D.
2010    2016                             Hamlet (III)
2010    2016                            Hamlet Frezer
2010    2011                                   Hamlet
2010    2017            Hamlet: The Fall of a Sparrow
2010    2013                      Harry, Hamlet and I
2010    2017                           Redneck Hamlet
2010    2016                              Hamlet (IV)
2010    2015                                   Hamlet
2010    2012                           Hamlet Unbound

### Count the number of "Rustler" characters in each decade of the history of film.

### Count the number of "Hamlet" characters in each decade.

In [80]:
# New column in "cast" dataframe with decades
cast['decade'] = cast['year']//10 *10

# All characters with "Hamlet" in the character role
filterHamletChar = cast['title'].str.contains('Hamlet') 
hamletCharacter = cast[filterHamletChar]

hamletCharacter.head()

,title,year,name,type,character,n,decade
1627,Hamlet,1996,Riz Abbasi,actor,Attendant to Claudius,1.0,1990
4275,Royal Shakespeare Company: Hamlet,2016,Hiran Abeysekera,actor,Horatio,8.0,2010
6469,"Hamlet, Prince of Denmark",1997,Ernest Abuba,actor,The King,NaN,1990
7488,Hamlet,1921,Fritz Achterberg,actor,"Fortinbras,",9.0,1920
11335,Hamlet,2009,Hayden Adams,actor,Laertes,7.0,2000

In [84]:
hamletCharacter.groupby('decade').agg({'title': 'count'})

        title
decade
1910       38
1920       18
1930       17
1940       24
1950        1
1960       78
1970       37
1980       18
1990      108
2000      294
2010      288

### What are the 11 most common character names in movie history?

title    921
dtype: int64

### Who are the 10 people most often credited as "Herself" in film history?

### Who are the 10 people most often credited as "Himself" in film history?

### Which actors or actresses appeared in the most movies in the year 1945?

### Which actors or actresses appeared in the most movies in the year 1985?

In [86]:

cast.head()

,title,year,name,type,character,n,decade
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN,2010
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0,1980
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0,2010
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN,2010
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN,2010

### How many roles "Mammootty" has played in each year of his career.

In [92]:
# total number of films per decade

filterMam = cast['name'].str.contains('Mammootty')
cast[filterMam].groupby('decade').agg({'title':'count'})

        title
decade
1970        1
1980      112
1990       52
2000       65
2010       45

In [109]:
# Testing another way of getting total number of films per decade
cast[filterMam].groupby('decade').agg(total=('decade', 'count'))

        total
decade
1970        1
1980      112
1990       52
2000       65
2010       45

In [133]:
# counting number of characters per year
cast[filterMam].groupby('year').count()['character']

year
1971     1
1980     2
1981     3
1982     7
1983    18
1984    16
1985    22
1986    18
1987     9
1988     7
1989    10
1990    15
1991     6
1992     3
1993     5
1994     5
1995     5
1996     3
1997     2
1998     4
1999     4
2000     7
2001     3
2002     3
2003     2
2004     8
2005     6
2006     8
2007     7
2008     9
2009    12
2010     9
2011     7
2012     7
2013     5
2014     6
2015     6
2016     4
2017     1
Name: character, dtype: int64

In [132]:
# Another way to do the same thing
cast[filterMam].groupby('year').agg(total_roles=('year', 'count'))

      total_roles
year
1971            1
1980            2
1981            3
1982            7
1983           18
1984           16
1985           22
1986           18
1987            9
1988            7
1989           10
1990           15
1991            6
1992            3
1993            5
1994            5
1995            5
1996            3
1997            2
1998            4
1999            4
2000            7
2001            3
2002            3
2003            2
2004            8
2005            6
2006            8
2007            7
2008            9
2009           12
2010            9
2011            7
2012            7
2013            5
2014            6
2015            6
2016            4
2017            1

### What are the 10 most frequent roles that start with the phrase "Patron in"?

### What are the 10 most frequent roles that start with the word "Science"?

### Count number of n-values of the roles that Judi Dench has played over her career.

In [135]:
filterJD = cast['name'].str.contains("Judi Dench")
judi = cast[filterJD]
judi.head()

,title,year,name,type,character,n,decade
2720471,84 Charing Cross Road,1987,Judi Dench,actress,Nora Doel,3.0,1980
2720472,A Handful of Dust,1988,Judi Dench,actress,Mrs. Beaver,13.0,1980
2720473,A Midsummer Night's Dream,1968,Judi Dench,actress,Titania,16.0,1960
2720474,A Room with a View,1985,Judi Dench,actress,"Eleanor Lavish, a novelist",7.0,1980
2720475,A Study in Terror,1965,Judi Dench,actress,Sally,8.0,1960

In [145]:
pd.DataFrame(judi['n'].value_counts().sort_index())

      n
1.0   6
2.0   6
3.0   6
4.0   4
5.0   2
6.0   4
7.0   4
8.0   1
9.0   1
12.0  3
13.0  2
16.0  2
18.0  2
20.0  1
23.0  1
26.0  1
29.0  1
40.0  1

### Count number of n-values of Cary Grant's roles through his career.

### Count number of n-value of the roles that Sidney Poitier has acted over the years.

### How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

### How many supporting (n=2) roles were available to actors, and how many to actresses, in the 1950s?